Revit 2026 API

# TranslationRotationValue Enumeration

---

Specifies the type of condition applied to the translation or rotation parameter.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TranslationRotationValue
```
```vb
Public Enumeration TranslationRotationValue
```
```cpp
public enum class TranslationRotationValue
```
```fsharp
type TranslationRotationValue
```

| Member name | Value | Description |
| --- | --- | --- |
| Fixed | 0 | The type of condition is Fixed. |
| Release | 1 | The type of condition is Release. |
| Spring | 2 | The type of condition is Spring. |

#### Reference

Autodesk.Revit.DB.Structure Namespace